//-----------------------------------------------------------------------------//
//          リファクタリング：未                  チェック：未
//-----------------------------------------------------------------------------//
#include "Common.h"
#include "BlockBase.h"
#include "UnbreakableBlock.h"

//-----------------------------------------------------------------------------//
//								コンストラクタ
//-----------------------------------------------------------------------------//
UnbreakableBlock::UnbreakableBlock(int sourceModelHandle,VECTOR startPos)
	:BlockBase(sourceModelHandle, startPos)
{
	blockName = WALL;
}

//-----------------------------------------------------------------------------//
//								デストラクタ
//-----------------------------------------------------------------------------//
UnbreakableBlock::~UnbreakableBlock()
{
	MV1DeleteModel(modelHandle);

}

//-----------------------------------------------------------------------------//
//								アップデート処理
//-----------------------------------------------------------------------------//
void UnbreakableBlock::Update()
{
	MV1SetPosition(modelHandle, pos);
}

//-----------------------------------------------------------------------------//
//								攻撃されたときの処理
//-----------------------------------------------------------------------------//
void UnbreakableBlock::Attacked(Player & player)
{
}

void UnbreakableBlock::OnBlock(Player& player)
{
}
